import numpy as np

## 기본 인덱싱

# 1차원 Indexing 
a = np.array([10, 20, 30, 40, 50])
a[0]    # 10  ← 0번째 요소
a[-1]   # 50  ← 마지막 요소

# 2 차원 Indexing
b = np.array([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]])
b[0, 0]   # 1  ← 0번째 행, 0번째 열
b[1, 2]   # 6  ← 1번째 행, 2번째 열

# 3차원 Indexing
c = np.array([
    [[1, 2, 3], [4, 5, 6]],
    [[7, 8, 9], [10, 11, 12]],
    [[13, 14, 15], [16, 17, 18]]
])
c[0, 0, 0]   # 1   ← 0번째 묶음, 0번째 행, 0번째 열
c[1, 1, 2]   # 12  ← 1번째 묶음, 1번째 행, 2번째 열



## 기본 슬라이싱

# 1차원 Slicing
a = np.array([10, 20, 30, 40, 50])  # shape (5,)
a[1:3]   # [20, 30]          
a[:3]    # [10, 20, 30]   
a[2:]    # [30, 40, 50] 
a[::2]   # [10, 30, 50]      
a[::-1]  # [50, 40, 30, 20, 10]

# 2차원 Slicing
b = np.array([[1, 2, 3],  # shape (3, 3)
              [4, 5, 6],
              [7, 8, 9]])  
b[0:2, :]    # [[1,2,3],[4,5,6]] 
b[:, 1:3]    # [[2,3],[5,6],[8,9]]
b[0:2, 1:3]  # [[2,3],[5,6]]      


# 3차원 Slicing
c = np.array([
    [[1, 2, 3], [4, 5, 6]],
    [[7, 8, 9], [10, 11, 12]],
    [[13, 14, 15], [16, 17, 18]]
])  # shape (3, 2, 3)
c[1:3, :, :]     # shape (2, 2, 3) ← 1~2번째 묶음 전체
c[1:3, ..., :2]  # shape (2, 2, 2) ← 1~2번째 묶음, 
                 # 지정하지 않은 차원 전부, 2번째 열 미만
c[:, 0, :]       # shape (3, 3)    ← 전체 묶음의 0번째 행
